/*// Task 1
let content = document.getElementById('content');
console.log(content);
let rules = document.getElementById('rules');
console.log(rules);
content.innerText = 'Мне сладких обманов романа не надо,\n' +
    'Прочь вымысел! Тщетно души не волнуй!\n' +
    'О, дайте мне луч упоенного взгляда\n' +
    'И первый стыдливый любви поцелуй!\n' +
    '\n' +
    'Поэт, воспевающий рощу и поле!\n' +
    'Спеши, - вдохновенье свое уврачуй!\n' +
    'Стихи твои хлынут потоком на воле,\n' +
    'Лишь вкусишь ты первый любви поцелуй!\n' +
    '\n' +
    'Не бойся, что Феб отвратит свои взоры,\n' +
    'О помощи муз не жалей, не тоскуй.\n' +
    'Что Феб музагет! что парнасские хоры!\n' +
    'Заменит их первый любви поцелуй!\n' +
    '\n' +
    'Не надо мне мертвых созданий искусства!\n' +
    'О, свет лицемерный, кляни и ликуй!\n' +
    'Я жду вдохновенья, где вырвалось чувство,\n' +
    'Где слышится первый любви поцелуй!\n' +
    '\n' +
    'Созданья мечты, где пастушки тоскуют,\n' +
    'Где дремлют стада у задумчивых струй,\n' +
    'Быть может, пленят, но души не взволнуют, -\n' +
    'Дороже мне первый любви поцелуй!\n' +
    '\n' +
    'О, кто говорит: человек, искупая\n' +
    'Грех праотца, вечно рыдай и горюй!\n' +
    'Нет! цел уголок недоступного рая:\n' +
    'Он там, где есть первый любви поцелуй!\n' +
    '\n' +
    'Пусть старость мне кровь беспощадно остудит,\n' +
    'Ты, память былого, мне сердце чаруй!\n' +
    'И лучшим сокровищем памяти будет -\n' +
    'Он - первый стыдливый любви поцелуй!'

rules.innerText = 'Ты ведь тоже – человек!\n' +
    'Приглядись поближе –\n' +
    'Видно, ты не выше всех,\n' +
    'Но ничуть не ниже!\n' +
    '\n' +
    'Бед немало перенес,\n' +
    'Знал удач немало…\n' +
    'Так что, брат, не вешай нос:\n' +
    'Наше не пропало!'

let all = document.getElementsByClassName('all');
console.log(all);
for (let allElement of all) {
    allElement.style.backgroundColor = 'red';
    allElement.style.color = 'blue';
}

console.log(rules.classList);

let fc_rules = document.getElementsByClassName('fc_rules');
console.log(fc_rules);
for (let fcRule of fc_rules) {
    fcRule.style.color = 'red';
}*/






